In [2]:
import pandas as pd
import numpy as np

### series data structure in pandas

In [3]:
list_1 = [10,20,30,40,50,60]
print(list_1)

[10, 20, 30, 40, 50, 60]

In [4]:
s1 = pd.Series(list_1 ,index =["A","B","C","D","E","F"])
s1

A    10
B    20
C    30
D    40
E    50
F    60
dtype: int64

In [5]:
array_1 = np.array([23,45,56,23,14])
array_2 = np.array([20,33,76,13,14])
array_1,array_2

(array([23, 45, 56, 23, 14]), array([20, 33, 76, 13, 14]))

In [6]:
sr11 = pd.Series(array_1)
sr22 = pd.Series(array_2)

In [7]:
sr11

0    23
1    45
2    56
3    23
4    14
dtype: int64

In [8]:
sr22

0    20
1    33
2    76
3    13
4    14
dtype: int64

In [9]:
sr11 + sr22

0     43
1     78
2    132
3     36
4     28
dtype: int64

### Dataframe for two dimensional dataset

In [10]:
student_list = ["student1","student2","student3","student4","student5"]
roll_no = ["002","003","004","005","006"]
marks = [56.75,67.5,69.25,90.5,85.5]

In [11]:
student_dict = {
    "Student Name": student_list,
    "Roll_no":roll_no,
    "Marks obtained":marks
}

In [12]:
student_dict

{'Student Name': ['student1', 'student2', 'student3', 'student4', 'student5'],
 'Roll_no': ['002', '003', '004', '005', '006'],
 'Marks obtained': [56.75, 67.5, 69.25, 90.5, 85.5]}

In [13]:
student_df = pd.DataFrame(student_dict)
student_df

  Student Name Roll_no  Marks obtained
0     student1     002           56.75
1     student2     003           67.50
2     student3     004           69.25
3     student4     005           90.50
4     student5     006           85.50

In [14]:
student_df.set_index("Roll_no",)

        Student Name  Marks obtained
Roll_no
002         student1           56.75
003         student2           67.50
004         student3           69.25
005         student4           90.50
006         student5           85.50

In [15]:
student_df["Student Name"]

0    student1
1    student2
2    student3
3    student4
4    student5
Name: Student Name, dtype: str

In [16]:
student_df["Marks obtained"]

0    56.75
1    67.50
2    69.25
3    90.50
4    85.50
Name: Marks obtained, dtype: float64

In [17]:
student_df[["Student Name","Marks obtained"]]

  Student Name  Marks obtained
0     student1           56.75
1     student2           67.50
2     student3           69.25
3     student4           90.50
4     student5           85.50

### adding new colum in the existing dataframe

In [18]:
student_df

  Student Name Roll_no  Marks obtained
0     student1     002           56.75
1     student2     003           67.50
2     student3     004           69.25
3     student4     005           90.50
4     student5     006           85.50

In [19]:
student_df["Address"] = ["Brt","itahari","jhapa","dharan","dhankuta"]
student_df

  Student Name Roll_no  Marks obtained   Address
0     student1     002           56.75       Brt
1     student2     003           67.50   itahari
2     student3     004           69.25     jhapa
3     student4     005           90.50    dharan
4     student5     006           85.50  dhankuta

In [20]:
df_2 = pd.DataFrame({
    "A" : np.arange(1,11),
    "B" : np.arange(11,21)
})

In [21]:
df_2

    A   B
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [22]:
df_2["C"] = df_2["A"] + df_2["B"]

In [23]:
df_2["C"]

0    12
1    14
2    16
3    18
4    20
5    22
6    24
7    26
8    28
9    30
Name: C, dtype: int64

In [24]:
df_2["D"] = (df_2["A"] + df_2["B"]+df_2["C"])/3
df_2

    A   B   C          D
0   1  11  12   8.000000
1   2  12  14   9.333333
2   3  13  16  10.666667
3   4  14  18  12.000000
4   5  15  20  13.333333
5   6  16  22  14.666667
6   7  17  24  16.000000
7   8  18  26  17.333333
8   9  19  28  18.666667
9  10  20  30  20.000000